tap "anomalyco/tap"
tap "domt4/autoupdate", "https://github.com/DomT4/homebrew-autoupdate.git"
tap "fluttergen/tap", "https://github.com/FlutterGen/homebrew-tap"
tap "fujiwara/tap"
tap "harelba/q"
tap "hashicorp/tap"
tap "modem-dev/tap"
tap "ngrok/ngrok"
tap "noborus/tap"
tap "oven-sh/bun"
tap "piory/old-casks"
tap "planetscale/tap"
tap "productdevbook/tap"
tap "steipete/tap"
tap "supabase/tap"
tap "universal-ctags/universal-ctags"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cloud Development Kit for Terraform
brew "cdktf"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Firebase command-line tools
brew "firebase-cli"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# Open-source GitLab command-line tool
brew "glab"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# GNU grep, egrep and fgrep
brew "grep"
# Like cURL, but for gRPC
brew "grpcurl"
# Agent multiplexer that lives in your terminal
brew "herdr"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Cross-platform TUI database management tool
brew "lazysql"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@17"
# Development kit for the Java programming language
brew "openjdk@21"
# Simplistic interactive filtering tool
brew "peco"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# CLI for Playwright: record/generate code, inspect selectors, take screenshots
brew "playwright-cli"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line interface for Vercel
brew "vercel-cli"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Watch files and take action when they change
brew "watchman"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Terraform
brew "hashicorp/tap/terraform", trusted: true
# Desktop-inspired terminal diff viewer for agent-authored changesets
brew "modem-dev/tap/hunk", trusted: true
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Menu bar icon organiser
cask "bartender"
# Virtual Audio Driver
cask "blackhole-2ch"
# Group chat software
cask "chatwork"
# Anthropic's official Claude AI desktop app
cask "claude"
# AI code review CLI
cask "coderabbit"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Menu bar usage monitor for Codex and Claude
cask "codexbar"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Japanese input software
cask "google-japanese-ime"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# App to manage software development and track bugs
cask "linear"
# Discover, download, and run local LLMs
cask "lm-studio"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok/ngrok/ngrok", trusted: true
# Handy utility to manage and customize the notch area
cask "notchnook"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Menu bar app to find and kill processes running on open ports
cask "productdevbook/tap/portkiller"
# VPN client focusing on security
cask "protonvpn"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# All-in-one live streaming software
cask "streamlabs"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# To-do & task list manager
cask "ticktick"
# System tray app for automatic time tracking
cask "wakatime"
# Video communication and virtual meeting platform
cask "zoom"
go "alpha-api"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/vektra/mockery/v2"
go "go.uber.org/mock/mockgen"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/kyoh86/richgo"
go "github.com/rhysd/vim-startuptime"
npm "@playwright/mcp"
npm "corepack"
