tap "fluttergen/tap"
tap "fujiwara/tap"
tap "harelba/q"
tap "homebrew/autoupdate"
tap "ngrok/ngrok"
tap "noborus/tap"
tap "oven-sh/bun"
tap "piory/old-casks"
tap "planetscale/tap"
tap "supabase/tap"
tap "universal-ctags/universal-ctags"
brew "bat"
brew "btop"
brew "cdktf"
brew "cloudflared"
brew "cocoapods"
brew "ripgrep"
brew "codex"
brew "fd"
brew "firebase-cli"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "gitleaks"
brew "gnupg"
brew "go"
brew "grep"
brew "grpcurl"
brew "icu4c@76"
brew "ios-deploy"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lcov"
brew "n"
brew "neovim"
brew "ollama"
brew "openjdk"
brew "openjdk@17"
brew "openjdk@21"
brew "peco"
brew "pinentry-mac"
brew "pkgconf"
brew "rust"
brew "terraform"
brew "terraformer"
brew "tig"
brew "tmux"
brew "tree"
brew "universal-ctags", args: ["HEAD"]
brew "uv"
brew "volta"
brew "watchman"
brew "weechat"
brew "fluttergen/tap/fluttergen"
brew "fujiwara/tap/tracer"
brew "noborus/tap/trdsql"
brew "oven-sh/bun/bun"
brew "planetscale/tap/pscale"
brew "supabase/tap/supabase"
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "arc"
cask "bartender"
cask "blackhole-2ch"
cask "bloomrpc"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "gcloud-cli"
cask "google-chrome"
cask "hyper"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keyboard-cleaner"
cask "linear-linear"
cask "lm-studio"
cask "ngrok"
cask "notchnook"
cask "notion"
cask "obsidian"
cask "slack"
cask "spotify"
cask "streamlabs"
cask "svgcleaner"
cask "thebrowsercompany-dia"
cask "ticktick"
cask "tor-browser"
cask "visual-studio-code"
cask "wakatime"
cask "warp"
cask "zoom"
vscode "asvetliakov.vscode-neovim"
vscode "blaugold.melos-code"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "googlecloudtools.firebase-dataconnect-vscode"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "k--kato.intellij-idea-keybindings"
vscode "liamwang.rainbow-drops-color-theme"
vscode "lightyen.tailwindcss-intellisense-twin"
vscode "marcelovelasquez.flutter-tree"
vscode "matt-meyers.vscode-dbml"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "zainchen.json"
