tap "anomalyco/tap"
tap "fluttergen/tap"
tap "fujiwara/tap"
tap "harelba/q"
tap "homebrew/autoupdate"
tap "ngrok/ngrok"
tap "noborus/tap"
tap "oven-sh/bun"
tap "piory/old-casks"
tap "planetscale/tap"
tap "productdevbook/tap"
tap "steipete/tap"
tap "supabase/tap"
tap "universal-ctags/universal-ctags"
brew "bat"
brew "btop"
brew "cdktf"
brew "cloudflared"
brew "cocoapods"
brew "fd"
brew "firebase-cli"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "ghq"
brew "git"
brew "gitleaks"
brew "gnupg"
brew "go"
brew "grep"
brew "grpcurl"
brew "icu4c@76"
brew "ios-deploy"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lcov"
brew "n"
brew "neovim"
brew "ollama"
brew "openjdk"
brew "openjdk@17"
brew "openjdk@21"
brew "peco"
brew "pinentry-mac"
brew "pkgconf"
brew "postgresql@14", restart_service: :changed
brew "ripgrep"
brew "rust"
brew "terraform"
brew "terraformer"
brew "tig"
brew "tmux"
brew "tree"
brew "universal-ctags", args: ["HEAD"]
brew "uv"
brew "volta"
brew "watchman"
brew "weechat"
brew "anomalyco/tap/opencode"
brew "fluttergen/tap/fluttergen"
brew "fujiwara/tap/tracer"
brew "noborus/tap/trdsql"
brew "oven-sh/bun/bun"
brew "planetscale/tap/pscale"
brew "supabase/tap/supabase"
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "appcleaner"
cask "arc"
cask "bartender"
cask "blackhole-2ch"
cask "bloomrpc"
cask "chatgpt"
cask "chatwork"
cask "claude"
cask "coderabbit"
cask "codex"
cask "steipete/tap/codexbar"
cask "discord"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "google-japanese-ime"
cask "hyper"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keyboard-cleaner"
cask "linear-linear"
cask "lm-studio"
cask "ngrok/ngrok/ngrok"
cask "notchnook"
cask "notion"
cask "obsidian"
cask "productdevbook/tap/portkiller"
cask "slack"
cask "spotify"
cask "streamlabs"
cask "thebrowsercompany-dia"
cask "ticktick"
cask "tor-browser"
cask "wakatime"
cask "warp"
cask "zoom"
go "alpha-api"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "go.uber.org/mock/mockgen"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/kyoh86/richgo"
go "github.com/rhysd/vim-startuptime"
