tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/autoupdade"
tap "universal-ctags/universal-ctags"
tap "homebrew/cask-fonts"
tap "planetscale/tap"

brew "bat"
brew "ghq"
brew "git"
brew "nvim"
brew "neovim"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "peco"
brew "tig"
brew "fd"
brew "fzf"
brew "tmux"
brew "lazygit"
brew "weechat"
brew "planetscale/tap/pscale"
brew "grep"
brew "gh"
brew "volta"
brew "supabase/tap/supabase"
brew "watchman"
brew "gpg"
brew "pinentry-mac"
brew "font-sauce-code-pro-nerd-font"
brew "ripgrep"
brew "blackhole-2ch"
brew "uv"
brew "oven-sh/bun/bun"

cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "discord"
cask "docker"
cask "google-chrome"
cask "hyper"
cask "font-hack-nerd-font"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "slack"
cask "visual-studio-code"
cask "keyboard-cleaner"
cask "hyperswitch"
cask "bartender"
cask "zoom"
cask "chatgpt"
cask "arc"
cask "claude"
cask "thebrowsercompany-dia"
cask "linear-linear"
